---
type: Gradient
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 22
tags: [revit-api, class]
---

# Gradient

`Autodesk.Revit.DB.Visual.Gradient` · Revit 2024 · 22 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | GradientColor | 2018.1 | `public static string GradientColor { get ; }` |
| Property | GradientInterpolation | 2018.1 | `public static string GradientInterpolation { get ; }` |
| Property | GradientNoise | 2018.1 | `public static string GradientNoise { get ; }` |
| Property | GradientNoiseAmount | 2018.1 | `public static string GradientNoiseAmount { get ; }` |
| Property | GradientNoiseHigh | 2018.1 | `public static string GradientNoiseHigh { get ; }` |
| Property | GradientNoiseLevels | 2018.1 | `public static string GradientNoiseLevels { get ; }` |
| Property | GradientNoiseLow | 2018.1 | `public static string GradientNoiseLow { get ; }` |
| Property | GradientNoisePhase | 2018.1 | `public static string GradientNoisePhase { get ; }` |
| Property | GradientNoiseSize | 2018.1 | `public static string GradientNoiseSize { get ; }` |
| Property | GradientNoiseSmooth | 2018.1 | `public static string GradientNoiseSmooth { get ; }` |
| Property | GradientPosition | 2018.1 | `public static string GradientPosition { get ; }` |
| Property | GradientType | 2018.1 | `public static string GradientType { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureOffsetLock | 2018.1 | `public static string TextureOffsetLock { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldScaleX | 2018.1 | `public static string TextureRealWorldScaleX { get ; }` |
| Property | TextureRealWorldScaleY | 2018.1 | `public static string TextureRealWorldScaleY { get ; }` |
| Property | TextureScaleLock | 2018.1 | `public static string TextureScaleLock { get ; }` |
| Property | TextureURepeat | 2018.1 | `public static string TextureURepeat { get ; }` |
| Property | TextureVRepeat | 2018.1 | `public static string TextureVRepeat { get ; }` |
| Property | TextureWAngle | 2018.1 | `public static string TextureWAngle { get ; }` |